/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 EXIT関数                                          */
/*                                                                              */
/*[機能概要]      命令EXITを実行する                                            */
/*                                                                              */
/*[記述形式]      int cmd_exit(T_TRACE *pk_trace, unsigned short * puh_1st_adr) */
/*                                                                              */
/*[パラメータ]    T_TRACE  *pk_trace            (I/O)トレースリスト用構造体     */
/*                unsigned short  *puh_1st_adr  (I)仮想メモリの先頭アドレス     */
/*                                                                              */
/*[戻り値]        CMD_OK         正常終了                                       */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2019.08.19  **********                                */
/*                                                                              */
/********************************************************************************/
#include "cmd_exit.h"

int cmd_exit(T_TRACE *pk_trace, unsigned short *puh_1st_adr)
{
    /***** プログラムレジスタ更新 *****/
    pk_trace->uh_pr += 1;

    /*正常終了*/
    return CMD_OK;
}

