/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 LD2語命令関数用ヘッダファイル                     */
/*                                                                              */
/*[機能概要]      LD2語命令関数用ヘッダファイル                                 */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2019.08.09  **********                                */
/*                                                                              */
/********************************************************************************/
#ifndef CMD_LD2_H
#define CMD_LD2_H

#include "comet_table.h"
#include "comet_define.h"

/*プロトタイプ宣言*/
int cmd_ld2(T_TRACE *pk_trace, unsigned short *puh_1st_adr);

#endif /*CMD_LD2_H*/
