/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 終了結果を表示する関数マクロ                      */
/*                                                                              */
/*[機能概要]      終了結果を表示する                                            */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2019.08.09  **********                                */
/*                                                                              */
/********************************************************************************/ 

#ifndef END_OUTPUT_H
#define END_OUTPUT_H

/***** インクルード宣言 *****/
#include<stdio.h>
#include"comet_define.h"
#include"comet_table.h"

/***** プロトタイプ宣言 *****/
int end_output ( int i_code);

#endif      /*END_OUTPUT_H*/
